src/ut10_old/Reports/АнализПродаж1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>АнализПродаж1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСкладов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокНоменклатуры</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/ut10_old/Reports/АнализПродаж1/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
Если ЗначениеЗаполнено(СписокСкладов) тогда
		
КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = СписокСкладов;
КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = Истина;

Иначе

КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = Ложь;

КонецЕсли;

Если ЗначениеЗаполнено(СписокНоменклатуры) тогда
		
КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ПравоеЗначение = СписокНоменклатуры;
КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = Истина;

Иначе

КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = Ложь;

КонецЕсли;

Если ЗначениеЗаполнено(ДатаНач) тогда
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач").Значение = ДатаНач;
	
Иначе
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач").Значение = НачалоМесяца(ТекущаяДата());
	
КонецЕсли;

Если ЗначениеЗаполнено(ДатаКон) тогда
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон").Значение = КонецДня(ДатаКон);
	
Иначе
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон").Значение = КонецМесяца(ТекущаяДата());
	
КонецЕсли;




КонецПроцедуры
